[NoCoverage] ArrayDeclaration
src/app/app.component.ts:15:25
 export class AppComponent {
 
   name: string;
-  contacts: Contact[] = [
-    { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
-    { id: 8, firstName: 'Frank', surname: 'Muscles', email: 'frank@muscles.com'},
-    { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},
-  ];
+  contacts: Contact[] = [];
 
   constructor() {

[NoCoverage] StringLiteral
src/app/app.component.ts:16:41
 
   name: string;
   contacts: Contact[] = [
-    { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
+    { id: 4, firstName: 'Sam', surname: "", email: 'sam.smith@music.com' },
     { id: 8, firstName: 'Frank', surname: 'Muscles', email: 'frank@muscles.com'},
     { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},

[NoCoverage] ObjectLiteral
src/app/app.component.ts:17:5
   name: string;
   contacts: Contact[] = [
     { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
-    { id: 8, firstName: 'Frank', surname: 'Muscles', email: 'frank@muscles.com'},
+    {},
     { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},
   ];

[NoCoverage] StringLiteral
src/app/app.component.ts:18:43
   contacts: Contact[] = [
     { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
     { id: 8, firstName: 'Frank', surname: 'Muscles', email: 'frank@muscles.com'},
-    { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},
+    { id: 15, firstName: 'Eddy', surname: "", email: 'eddy@valfam.co.uk'},
   ];
 

[NoCoverage] StringLiteral
src/app/app.component.ts:18:63
   contacts: Contact[] = [
     { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
     { id: 8, firstName: 'Frank', surname: 'Muscles', email: 'frank@muscles.com'},
-    { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},
+    { id: 15, firstName: 'Eddy', surname: 'Valentino', email: ""},
   ];
 

[NoCoverage] BlockStatement
src/app/app.component.ts:21:17
     { id: 15, firstName: 'Eddy', surname: 'Valentino', email: 'eddy@valfam.co.uk'},
   ];
 
-  constructor() {
-    this.name = 'world!';
-  }
+  constructor() {}
 
   delete(contact: Contact){

[NoCoverage] BlockStatement
src/app/app.component.ts:25:27
     this.name = 'world!';
   }
 
-  delete(contact: Contact){
-    this.contacts.splice(this.contacts.indexOf(contact), 1);
-  }
+  delete(contact: Contact){}
 
   changeColor(contact: Contact, event: Event){
