[Killed] BlockStatement
src/app/pipes/contact-name.pipe.ts:10:38
 })
 export class ContactNamePipe implements PipeTransform {
 
-  transform(value: Contact): unknown {
-    return `${value.firstName} ${value.surname}`;
-  }
+  transform(value: Contact): unknown {}
 
 }
killedBy: ContactNamePipe should concatenate a contact name
statusReason: Expected undefined to be 'Sam Smith'.
