[Survived] ArrayDeclaration
src/app/contact-list/contact-list.component.ts:13:34
   styleUrl: './contact-list.component.scss'
 })
 export class ContactListComponent {
-  @Input() contacts: Contact[] = [];
+  @Input() contacts: Contact[] = ["Stryker was here"];
   @Output() deleted = new EventEmitter<Contact>();
 

[Survived] BlockStatement
src/app/contact-list/contact-list.component.ts:16:27
   @Input() contacts: Contact[] = [];
   @Output() deleted = new EventEmitter<Contact>();
 
-  delete(contact: Contact){
-    this.deleted.emit(contact);
-  }
+  delete(contact: Contact){}
 
   changeColor(contact: Contact, event: Event) {

[NoCoverage] BlockStatement
src/app/contact-list/contact-list.component.ts:20:47
     this.deleted.emit(contact);
   }
 
-  changeColor(contact: Contact, event: Event) {
-    contact.color = (event.target as HTMLInputElement).value;
-  }
+  changeColor(contact: Contact, event: Event) {}
 }
 
